
{
  "address": {
    "name": "Yohans Hailu Kasaw",
    "phone": "+251-929-260-704",
    "email": "yohanshailukasaw@gmail.com",
    "location": "Addis Ababa, Ethiopia",
    "linkedin": "https://www.linkedin.com/in/yohans-hailu/",
    "github": "https://github.com/YohansHailu"
  },
  "summary": "Energetic Software Engineer with 4+ years of experience driving end-to-end software solutions in fast-paced environments. Skilled in concurrency, OOP, and networking principles, adept at architecting scalable APIs, and proficient in frameworks like React, Node.js, Go, and Java. Demonstrated success in daily code reviews, automated testing, and continuous deployments, fueled by a passion for delivering secure, reliable features. Recognized for a collaborative ethos, ownership mentality, and a commitment to building products that enrich user experiences.",
  "education": {
    "items": [
      {
        "institution": "Addis Ababa University | Computer Engineering",
        "period": "06/2021",
        "details": [
          "🏅 GPA: 3.79, Top 4% of class."
        ]
      },
      {
        "institution": "A2SV | Competitive Programming",
        "period": "10/2021 - 09/2022",
        "details": [
          "Combined mastery of data structures (trees, graphs, Dijkstra’s) with strong concurrency and parallelization techniques in Python, Go, and C++ to build performant software solutions.",
          "Achieved Top 2.5% LeetCode and Codeforces ratings by solving 1,000+ algorithmic challenges, demonstrating exceptional problem-solving, teamwork, and dedication."
        ]
      }
    ]
  },
  "experience": {
    "items": [
      {
        "role": "OwlBox AI | Software Engineer",
        "period": "04/2023 - Present",
        "details": [
          "Took end-to-end ownership of an AI-driven video annotation platform, designing, developing, and releasing features using React, Next.js, Redux, and TypeScript in tandem with Python-based microservices.",
          "Instituted daily pull requests and peer reviews to promote knowledge-sharing and ensure code quality, leveraging CI/CD pipelines with GitHub Actions for seamless deployments on AWS (Lambda, EC2, S3, RDS).",
          "Optimized concurrency in Celery tasks to boost throughput by 20%, while architecting robust RESTful APIs and secure gateway layers for scalable load distribution."
        ]
      },
      {
        "role": "Africa to Silicon Valley | Head of Education & Software Engineer",
        "period": "06/2021 - 04/2023",
        "details": [
          "Directed design and implementation of front-end applications (React, Next.js, Redux, TypeScript) for initiatives like HakimHub, integrating real-time notifications and video functionalities.",
          "Guided the back-end team for RateEat, utilizing Node.js and Nest.js with microservices on GCP, orchestrating concurrency-safe APIs and data pipelines for a high-volume food delivery system.",
          "Led full-stack development for EzyPay, championing on-call rotations, code reviews, and automated testing to reduce production incidents and accelerate stable releases to AWS (EC2, S3, Lambda, RDS, DynamoDB)."
        ]
      },
      {
        "role": "Eskalate | Software Engineer Intern",
        "period": "12/2020 - 07/2021",
        "details": [
          "Developed modular, secure RESTful APIs with Flask, SQLAlchemy, Docker, and Kubernetes, ensuring data consistency through ACID-compliant transactions and concurrency control.",
          "Strengthened system reliability by implementing robust QA frameworks (Selenium, Jest, Cypress, Postman) and CI/CD pipelines (Jenkins, GitHub Actions), leading to a measurable decrease in bug rates and improved customer satisfaction."
        ]
      }
    ]
  },
  "projects": {
    "items": [
      {
        "role": "EzyPay",
        "details": [
          "Introduced concurrent Go-based services for faster transaction processing and high availability in Ethiopian mobile payment systems.",
          "Deployed scalable architecture on AWS, ensuring automatic load balancing for payment flows that maintained secure user transactions."
        ]
      },
      {
        "role": "RateEat",
        "details": [
          "Engineered dynamic rating and review features using React for real-time data updates, enabling a smooth user experience and robust concurrency handling for multiple simultaneous updates."
        ]
      }
    ]
  },
  "skills": {
    "items": [
      {
        "details": [
          "Programming Languages: Python, Go, JavaScript, TypeScript, Java, C/C++, Bash/Shell Scripting",
          "Web Technologies: HTML5, CSS3, React, Next.js, Redux, Vue.js, Nuxt.js, Svelte",
          "Backend & Architecture: Node.js, Express.js, Flask, Nest.js, RESTful APIs, Microservices, GraphQL, WebSockets",
          "Cloud & DevOps: AWS (Lambda, S3, EKS, EC2, ECS, API Gateway), Docker, Kubernetes, GitHub Actions, Jenkins",
          "Databases: MySQL, PostgreSQL, MongoDB, Redis (ACID principles, transactions, locks)",
          "Software Practices: TDD, CI/CD, Code Reviews, OOP (SOLID, design patterns), Concurrency (parallelization, asynchronicity, race conditions)"
        ]
      }
    ]
  },
  "achievements": {
    "items": [
      {
        "details": [
          "Ranked in the top 2.5% globally on LeetCode, demonstrating advanced algorithmic and concurrency expertise.",
          "Awarded $1000 in an A2SV Month-Long Coding Competition, highlighting strong problem-solving skills and commitment to high-quality, scalable solutions."
        ]
      }
    ]
  }
}
