{
  "address": {
    "name": "Yohans Hailu Kasaw",
    "phone": "+251-929-260-704",
    "email": "yohanshailukasaw@gmail.com",
    "location": "Addis Ababa, Ethiopia",
    "linkedin": "https://www.linkedin.com/in/yohans-hailu/",
    "github": "https://github.com/YohansHailu"
  },
  "summary": "Self-driven Software Engineer with 4+ years of experience building data-driven and AI-enhanced solutions, skilled in Python, cloud technologies, and distributed systems. Adept at translating complex requirements into scalable APIs, orchestrating microservices, and collaborating with cross-functional teams. Top 2.5% LeetCode rank, driven by a passion for real-time data insights, robust testing, and continuous improvement.",
  "education": {
    "items": [
      {
        "institution": "Addis Ababa University | Computer Engineering",
        "period": "06/2021",
        "details": [
          "🏅 GPA: 3.79, Top 4% of class."
        ]
      },
      {
        "institution": "A2SV | Competitive Programming",
        "period": "10/2021 - 09/2022",
        "details": [
          "Focused extensively on Python data structures and algorithms (graphs, dynamic programming, BFS/DFS) to build high-performance solutions.",
          "Achieved Top 2.5% LeetCode rating by solving 1,000+ coding challenges, demonstrating rigorous problem-solving, collaboration, and perseverance."
        ]
      }
    ]
  },
  "experience": {
    "items": [
      {
        "role": "OwlBox AI | Software Engineer, AI & Data Intelligence",
        "period": "04/2023 - Present",
        "details": [
          "Develop and maintain a scalable AI-driven video annotation platform, leveraging Python-based microservices and serverless frameworks on AWS (Lambda, EC2, S3).",
          "Collaborate with data scientists to design and optimize data ingestion and processing workflows, delivering actionable insights for video labeling and analytics.",
          "Integrate Celery for asynchronous task management and implement comprehensive logging/monitoring (Grafana, Sentry) to ensure system reliability and performance.",
          "Lead peer code reviews, unit tests, and CI/CD pipelines (GitHub Actions) to uphold code quality and enable smooth, continuous deployments."
        ]
      },
      {
        "role": "Africa to Silicon Valley | Head of Education & Software Engineer",
        "period": "06/2021 - 04/2023",
        "details": [
          "Oversaw full-stack initiatives for HakimHub, including designing RESTful APIs in Python and Node.js, enabling secure data access and real-time health center notifications.",
          "Architected the backend for RateEat with Node.js and Nest.js on Google Cloud Platform (GCP), implementing microservices, Docker, and Kubernetes to process large-scale restaurant data.",
          "Integrated MongoDB and Redis for caching and efficient data retrieval, accelerating queries by 25% in dynamic food-delivery and rating systems.",
          "Built collaborative code review practices, structured sprints, and QA testing strategies to foster team growth and deliver robust, scalable solutions."
        ]
      },
      {
        "role": "Eskalate | Software Engineer Intern",
        "period": "12/2020 - 07/2021",
        "details": [
          "Created secure and modular Python Flask APIs with SQLAlchemy, JWT, and OAuth, using Docker and Kubernetes for container orchestration and deployment.",
          "Introduced continuous testing with Selenium, Cypress, and Postman, reducing defect leakage by 30% and improving overall software quality.",
          "Played an active role in code reviews, cross-team design discussions, and performance optimization, enhancing reliability and collaborative engineering culture."
        ]
      }
    ]
  },
  "projects": {
    "items": [
      {
        "role": "EzyPay",
        "details": [
          "Spearheaded backend development in Go, focusing on modular microservices and load balancing for efficient mobile payment processing.",
          "Implemented analytics dashboards and logging mechanisms to provide real-time insights into transactional metrics."
        ]
      },
      {
        "role": "RateEat",
        "details": [
          "Developed a data-driven rating platform with React and Node.js, integrating machine learning prototypes to analyze user reviews and detect trends.",
          "Optimized GCP-hosted microservices with Docker and Kubernetes, ensuring reliability and fast response times under heavy traffic."
        ]
      }
    ]
  },
  "skills": {
    "items": [
      {
        "details": [
          "Programming Languages: Python, Go, JavaScript, TypeScript, C/C++, Bash/Shell scripting, Scala",
          "Web Technologies: HTML5, CSS3, React, Next.js, Redux, Vite, Vue.js, Vuex, Nuxt.js, Svelte",
          "Backend Technologies: Node.js, Express.js, Django, Flask, FastAPI, RESTful APIs, GraphQL, WebSockets",
          "Data & Cloud Technologies: GCP (GKE, BigQuery), AWS (Lambda, S3, EKS, EC2, ECS, API Gateways), Docker, Kubernetes, GitHub Actions, Jenkins, MongoDB, Redis, MySQL, PostgreSQL"
        ]
      }
    ]
  },
  "achievements": {
    "items": [
      {
        "details": [
          "Earned Top 2.5% LeetCode ranking, demonstrating strong algorithmic fluency in Python and Go.",
          "Won $1000 in A2SV Month-Long Coding Competition by delivering innovative solutions to challenging data-structure and algorithmic problems."
        ]
      }
    ]
  }
}
