{
  "address": {
    "name": "Yohans Hailu Kasaw",
    "phone": "+251-929-260-704",
    "email": "yohanshailukasaw@gmail.com",
    "location": "Addis Ababa, Ethiopia",
    "linkedin": "https://www.linkedin.com/in/yohans-hailu/",
    "github": "https://github.com/YohansHailu"
  },
  "summary": "Full Stack Software Engineer with 4+ years of experience developing high-performance web applications using Python, Django, and Vue.js. Proven track record in designing scalable architectures and delivering well-crafted, maintainable code. Exceptional problem solver ranked in the top 2.5% on LeetCode. Adaptable and eager to learn new techniques, with excellent communication skills in English. Open to global opportunities and challenges.",
  "education": {
    "items": [
      {
        "institution": "Addis Ababa University | Computer Engineering",
        "period": "Graduated: 06/2021",
        "details": ["GPA: 3.79, Top 4% of class."]
      },
      {
        "institution": "A2SV | Competitive Programming",
        "period": "10/2021 - 09/2022",
        "details": [
          "Mastered data structures and algorithms, utilizing Python to engineer robust and efficient software solutions.",
          "Achieved Top 2.5% LeetCode ranking by solving over 1,000 algorithmic challenges, showcasing exceptional problem-solving skills."
        ]
      }
    ]
  },
  "experience": {
    "items": [
      {
        "role": "OwlBox AI | Full Stack Software Engineer",
        "period": "04/2023 - Present",
        "details": [
          "Led the development of an AI-driven video annotation platform using Vue.js and Vuex, enhancing user responsiveness and interface by 30%.",
          "Engineered a scalable backend with Python and Django, implementing RESTful APIs and ensuring optimal performance and reliability.",
          "Integrated Celery for asynchronous task management, improving task processing speed by 25%. Managed CI/CD pipelines with GitHub Actions for seamless AWS deployments."
        ]
      },
      {
        "role": "Africa to Silicon Valley | Software Engineer",
        "period": "06/2021 - 04/2023",
        "details": [
          "Developed HakimHub's frontend using Vue.js and TypeScript, facilitating real-time notifications and enhancing user engagement.",
          "Architected and scaled backend services for RateEat using Django, hosted on GCP with PostgreSQL and Redis, contributing to a 40% increase in system scalability.",
          "Coordinated with cross-functional teams to develop web applications across various platforms, managing testing and implementing software enhancements."
        ]
      },
      {
        "role": "Eskalate | Software Engineer Intern",
        "period": "12/2020 - 07/2021",
        "details": [
          "Developed and maintained web applications using Python, Django, and various Python libraries, focusing on code quality and maintainability.",
          "Implemented testing frameworks and managed CI/CD pipelines, reducing bug rates by 15% and improving software quality."
        ]
      }
    ]
  },
  "projects": {
    "items": [
      {
        "role": "EzyPay",
        "details": [
          "Enhanced mobile payment system efficiency in Ethiopia by developing backend services using Python and Django.",
          "Improved transaction processing speed by 20% and ensured system scalability to handle increasing user demands."
        ]
      },
      {
        "role": "RateEat",
        "details": [
          "Developed a dynamic restaurant rating platform with Vue.js, improving user interaction and engagement.",
          "Implemented backend services with Django, ensuring optimal performance and responsiveness of the application."
        ]
      }
    ]
  },
  "skills": {
    "items": [
      {
        "details": [
          "Programming Languages: Python, JavaScript, TypeScript, Go, C++",
          "Frameworks & Libraries: Django, Vue.js, Vuex, Nuxt.js, Flask, FastAPI",
          "Web Technologies: HTML5, CSS3, RESTful APIs, GraphQL, WebSockets",
          "Python Libraries & Toolkits: Celery, NumPy, Pandas, SQLAlchemy",
          "Databases: MySQL, PostgreSQL, MongoDB, Redis",
          "DevOps & Cloud: AWS (Lambda, S3, EC2, RDS), Docker, Kubernetes, GitHub Actions, Jenkins",
          "Soft Skills: Excellent communication, teamwork, adaptability, and problem-solving"
        ]
      }
    ]
  },
  "achievements": {
    "items": [
      {
        "details": [
          "Top 2.5% on LeetCode, demonstrating exceptional problem-solving abilities in Python.",
          "Won $1,000 in A2SV Month-Long Coding Competition, exhibiting dedication and coding excellence."
        ]
      }
    ]
  }
}
