{
  "address": {
    "name": "Yohans Hailu Kasaw",
    "phone": "+251-929-260-704",
    "email": "yohanshailukasaw@gmail.com",
    "location": "Addis Ababa, Ethiopia",
    "linkedin": "https://www.linkedin.com/in/yohans-hailu/",
    "github": "https://github.com/YohansHailu"
  },
  "summary": "Backend-focused Software Engineer with 4+ years of experience architecting microservices and developing APIs that power scalable, high-performance applications. Fluent in English, with a track record of building collaborative, cross-functional teams for international projects. Skilled in Node.js, Docker, Kubernetes, and cloud services (AWS, GCP), leveraging strong problem-solving abilities to deliver secure, resilient, and efficient solutions.",
  "education": {
    "items": [
      {
        "institution": "Addis Ababa University | Computer Engineering",
        "period": "06/2021",
        "details": [
          "🏅 GPA: 3.79, graduated in the top 4% of the class."
        ]
      },
      {
        "institution": "A2SV | Competitive Programming",
        "period": "10/2021 - 09/2022",
        "details": [
          "Gained advanced proficiency in data structures, algorithms, and coding best practices using Python, Go, and C++, solving 1,000+ algorithmic challenges.",
          "Ranked in top global tiers on LeetCode and Codeforces, consistently demonstrating strong analytical thinking and teamwork."
        ]
      }
    ]
  },
  "experience": {
    "items": [
      {
        "role": "OwlBox AI | Backend & DevOps Engineer",
        "period": "04/2023 - Present",
        "details": [
          "Spearheaded backend development in Node.js and Flask microservices, integrating Celery for asynchronous tasks and AWS (Lambda, EC2, S3, RDS) for auto-scaling and seamless deployments via GitHub Actions.",
          "Built RESTful APIs with secure authentication layers and managed robust data flows across PostgreSQL and MongoDB databases, reducing downtime by 20%.",
          "Introduced best practices in containerization (Docker) and orchestration (Kubernetes), streamlining the CI/CD process and improving overall system reliability and performance."
        ]
      },
      {
        "role": "Africa to Silicon Valley | Backend Developer & Team Lead",
        "period": "06/2021 - 04/2023",
        "details": [
          "Led a cross-functional team on RateEat, architecting Node.js/Nest.js microservices deployed on Google Cloud (GCP) with Docker, Kubernetes, and Redis caching, boosting operational efficiency and supporting thousands of daily requests.",
          "Guided junior developers in code reviews and agile best practices, enhancing code quality and enforcing maintainable project structures.",
          "Coordinated with US-based clients and stakeholders to align on technical roadmaps and deliver highly available backend solutions for one of Addis Ababa's pioneering food delivery platforms."
        ]
      },
      {
        "role": "Eskalate | Software Engineer Intern",
        "period": "12/2020 - 07/2021",
        "details": [
          "Developed and deployed modular APIs using Flask, Node.js, SQLAlchemy, JWT, OAuth, and Docker, supporting business-critical operations for various clients.",
          "Enhanced testing coverage (unit, integration) with Jest, Cypress, and Postman, reducing production defects by 15% and increasing overall reliability."
        ]
      }
    ]
  },
  "projects": {
    "items": [
      {
        "role": "EzyPay",
        "details": [
          "Built a scalable payment solution for mobile transactions in Ethiopia using Go microservices on AWS (EC2, Lambda, RDS).",
          "Implemented distributed system patterns, ensuring minimal latency and near real-time transaction processing."
        ]
      },
      {
        "role": "RateEat",
        "details": [
          "Delivered a responsive React frontend for restaurant ratings, integrating Node.js-based backend services and database caching for rapid data retrieval.",
          "Optimized user experience with quick loading times, resulting in a notable uptick in user engagement."
        ]
      }
    ]
  },
  "skills": {
    "items": [
      {
        "details": [
          "Programming Languages: Node.js, Python, Go, JavaScript, TypeScript, C/C++, Bash/Shell scripting",
          "Backend & APIs: Express.js, Nest.js, Flask, RESTful APIs, GraphQL, Microservices",
          "Databases: PostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy",
          "Cloud & DevOps: AWS (Lambda, S3, EC2, RDS), GCP, Docker, Kubernetes, GitHub Actions, Jenkins",
          "Web Frameworks: React, Next.js, Redux, Vue.js, Nuxt.js, Svelte",
          "Agile & Tools: Git, Scrum, Kanban, CI/CD, Automated Testing (Cypress, Jest, Mocha)"
        ]
      }
    ]
  },
  "achievements": {
    "items": [
      {
        "details": [
          "Achieved top 2.5% ranking on LeetCode, reflecting strong problem-solving in Node.js, Python, and Go.",
          "Won $1000 in a month-long coding competition at A2SV by delivering innovative solutions under tight deadlines."
        ]
      }
    ]
  }
}
